tutorials/snappyHexMesh/case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    inlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1348;
        startFace       277534;
    }
    outlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2613;
        startFace       278882;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          13334;
        startFace       281495;
    }
)

// ************************************************************************* //
